# MassSurfaceSubCategoryId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConceptualConstructionType..::..MassSurfaceSubCategoryId Property
ConceptualConstructionType Class See Also
---
The surface type subcategory element id associated with the ConceptualConstructionType.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId MassSurfaceSubCategoryId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MassSurfaceSubCategoryId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ MassSurfaceSubCategoryId {
	ElementId^ get ();
}
```

# See Also
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace